### Pandas

In [29]:
import pandas as pd

In [30]:
pd.__version__

'2.2.2'

### Series Object

In [31]:
data = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
data

a    10
b    20
c    30
d    40
dtype: int64

In [32]:
dict_1 = {"Dhaka" : 123423432, "Chittagong" : 21342213, "Noakhali": 12432214213642}
series = pd.Series(dict_1, name="Population")
series

Dhaka              123423432
Chittagong          21342213
Noakhali      12432214213642
Name: Population, dtype: int64

In [33]:
series["Dhaka"]

np.int64(123423432)

### DataFrame Object

In [34]:
import numpy as np
numpy_array = np.random.rand(3, 4)
numpy_array

array([[0.0582138 , 0.55258743, 0.42910312, 0.00112563],
       [0.62723936, 0.50546165, 0.05250164, 0.57438369],
       [0.2654972 , 0.39880211, 0.27488775, 0.03510487]])

In [35]:
df1 = pd.DataFrame(numpy_array, columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0  0.058214  0.552587  0.429103  0.001126
1  0.627239  0.505462  0.052502  0.574384
2  0.265497  0.398802  0.274888  0.035105

In [36]:
df2 = pd.DataFrame(series)
df2

                Population
Dhaka            123423432
Chittagong        21342213
Noakhali    12432214213642

In [37]:
pd.DataFrame([dict_1])

       Dhaka  Chittagong        Noakhali
0  123423432    21342213  12432214213642

### Data Indexing

In [38]:
df1

          a         b         c         d
0  0.058214  0.552587  0.429103  0.001126
1  0.627239  0.505462  0.052502  0.574384
2  0.265497  0.398802  0.274888  0.035105

In [39]:
df1["a"]

0    0.058214
1    0.627239
2    0.265497
Name: a, dtype: float64

In [40]:
df1.b

0    0.552587
1    0.505462
2    0.398802
Name: b, dtype: float64

In [41]:
df1.values[0] # first row

array([0.0582138 , 0.55258743, 0.42910312, 0.00112563])

In [42]:
df1.iloc[1, 1] # indexing pandas dataframe like a numpy array

np.float64(0.5054616549135758)

In [43]:
df1.iloc[1:, 2:]

          c         d
1  0.052502  0.574384
2  0.274888  0.035105

### Numpy Ufuncs

In [44]:
rng = np.random.default_rng(42)
df3 = pd.DataFrame(rng.integers(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df3

   A  B  C  D
0  0  7  6  4
1  4  8  0  6
2  2  0  5  9

In [45]:
np.sin(df3)

          A         B         C         D
0  0.000000  0.656987 -0.279415 -0.756802
1 -0.756802  0.989358  0.000000 -0.279415
2  0.909297  0.000000 -0.958924  0.412118

In [46]:
df3 * 2

   A   B   C   D
0  0  14  12   8
1  8  16   0  12
2  4   0  10  18

In [47]:
df3 / 10

     A    B    C    D
0  0.0  0.7  0.6  0.4
1  0.4  0.8  0.0  0.6
2  0.2  0.0  0.5  0.9

In [48]:
df3 ** 2

    A   B   C   D
0   0  49  36  16
1  16  64   0  36
2   4   0  25  81

### Ufuncs: Index Alignment

In [49]:
df2

                Population
Dhaka            123423432
Chittagong        21342213
Noakhali    12432214213642

In [50]:
df21 = pd.DataFrame([2342345234, 54325435, 7856783], index=['Dhaka', 'Natore', 'Noakhali'], columns=['Population'])
df21

          Population
Dhaka     2342345234
Natore      54325435
Noakhali     7856783

In [51]:
df2 + df21

              Population
Chittagong           NaN
Dhaka       2.465769e+09
Natore               NaN
Noakhali    1.243222e+13

In [52]:
df2.add(df21, fill_value=0)

              Population
Chittagong  2.134221e+07
Dhaka       2.465769e+09
Natore      5.432544e+07
Noakhali    1.243222e+13